[{"title":"RIA avec Flex et Java","description":
    "\u003cp\u003e\u003cfont color\u003d\"red\"\u003eIl n\u0026#8217;y a malheureusement plus de places disponibles, pour être sur la liste d\u0026#8217;attente: \u003ca href\u003d\"mailto:team@genevajug.ch\"\u003eteam@genevajug.ch\u003c/a\u003e\u003c/font\u003e\u003c/p\u003e\u003cp\u003eLors de cette session de rentrée, Pascal nous fera découvrir l\u0026#8217;environnement Flex ainsi que les meilleures pratiques quand à son intégration avec le monde JEE : \u003cbr/\u003e\u003cul\u003e\u003cbr/\u003e\u003cli\u003eBuild Maven, \u003c/li\u003e\u003cbr/\u003e\u003cli\u003eIntégration Spring, \u003c/li\u003e\u003cbr/\u003e\u003cli\u003eSécurité, \u003c/li\u003e\u003cbr/\u003e\u003cli\u003eTests unitaires...\u003c/li\u003e\u003cbr/\u003e\u003c/ul\u003e\u003cbr/\u003e\u003cbr/\u003eComme d’habitude cette soirée se finira par un buffet offert par nos sponsors\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003ccenter\u003e\u003cbr/\u003e\u003ca href\u003d\"http://www.hortis.ch/\"\u003e\u003cimg width\u003d\"180\" src\u003d\"http://www.genevajug.ch/svp-fs/componentId/kmelia1132/attachmentId/12942/lang/fr/name/logoHortis.jpg\" border\u003d\"0\"/\u003e\u003ca/\u003e  \u003ca href\u003d\"http://www.oosphere.ch/\"\u003e\u003cimg width\u003d\"120\" src\u003d\"http://www.genevajug.ch/svp-fs/componentId/kmelia1132/attachmentId/13415/lang/fr/name/LogoOO.png\" border\u003d\"0\"/\u003e\u003c/a\u003e  \u003ca href\u003d\"http://www.kalyss.com/\" \u003e\u003cimg width\u003d\"120\" src\u003d\"http://www.genevajug.ch/svp-fs/componentId/kmelia1132/attachmentId/13507/lang/fr/name/Kalyss.GIF\" border\u003d\"0\" /\u003e\u003ca/\u003e\u003cbr/\u003e\u003ca href\u003d\"http://www.cross-systems.ch\"\u003e\u003cimg width\u003d\"180\" src\u003d\"http://www.genevajug.ch/svp-fs/componentId/kmelia1132/attachmentId/14001/lang/fr/name/Logo_cross_systems3.png\" border\u003d\"0\"/\u003e\u003c/a\u003e  \u003ca href\u003d\"http://www.genesis-groupe.com\"\u003e\u003cimg width\u003d\"180\" src\u003d\"http://www.genevajug.ch/svp-fs/componentId/kmelia1132/attachmentId/14102/lang/fr/name/logoGenesis.png\" border\u003d\"0\"/\u003e\u003c/a\u003e  \u003ca href\u003d\"http://www.ilem.ch\"\u003e\u003cimg width\u003d\"120\" src\u003d\"http://www.genevajug.ch/svp-fs/componentId/kmelia1132/attachmentId/13890/lang/fr/name/Ilem.jpg\" border\u003d\"0\" /\u003e\u003c/a\u003e\u003cbr /\u003e \u003cbr/\u003e\u003c/center\u003e\u003c/p\u003e",
    "start":"2010-08-30 18:30:00","end":"2010-08-30 20:30:00","allDay":
    false,"jugName":"GenevaJUG","jugWebSite":"http://www.genevajug.ch"},{
    "title":"Spring Meeting settembre 2010","description":
    "\u003cp\u003eQuinta Edizione Spring Framework Meeting settembre 2010\u003c/p\u003e\u003cp\u003eLo Spring Framework Italian User Group in collaborazione con il Java User Group Sardegna Onlus la Oracle e il DIEE organizza lo Spring Meeting di settembre 2010\u003c/p\u003e\u003cp\u003eUn serie di conferenze sul mondo Java a Cagliari, Sabato 4 settembre giugno 2009 dalle 9:00 alle 13:30, presso l\u0027 Aula B0 della facolta di Ingegneria Elettronica\u003c/p\u003e\u003cp\u003eLista speakers a abstracts:\u003c/p\u003e\u003cp\u003eEmiliano Pecis \u0026#8211; Oracle Coherence: come scalare con il grid computing\u003c/p\u003e\u003cp\u003eGiuseppe Maxia \u0026#8211; MySQL Introduzione a Gearman\u003c/p\u003e\u003cp\u003eGabriele Columbro \u0026#8211; Alfresco Spring Surf roadmap, developer tools e integrazione con CMIS per la costruzione di applicazioni content centric\u003c/p\u003e\u003cp\u003eLuca Stancapiano \u0026#8211; JBOSS GATEIN\u003c/p\u003e",
    "start":"2010-09-03 08:30:00","end":"2010-09-03 14:00:00","allDay":
    false,"jugName":"JugSardegna","jugWebSite":
    "http://it.groups.yahoo.com/group/SpringFramework-it"},{"title":
    "Sebastien Stormacq, Build a RESTful Client-Server RIA with JavaFX Technology and Jersey",
    "description":
    "\u003cp\u003eSebastien Stormacq, Build a RESTful Client-Server RIA with JavaFX Technology and Jersey\u003c/p\u003e",
    "start":"2010-09-09 19:00:00","end":"2010-09-09 22:00:00","allDay":
    false,"jugName":"Brussels JUG","jugFriendlyName":"","jugWebSite":
    "http://www.brujug.be"},{"title":
    "The ROI of Refactoring: Lego vs. Play-Doh","description":
    "\u003cp\u003eDescription\u003c/p\u003e\u003cp\u003eRefactoring is one of the most powerful tools for improving the intrinsic quality of any code base. Yet, as important as refactoring is, non-technical business stakeholders tend to see little value in the practice. After struggling for a decade to articulate refactoring in such a way that the ROI was obvious, I finally stumbled upon an analogy that seems to work: Building with Lego vs. Play-Doh. In this presentation I will demonstrate the techniques I use to turn an apprehensive room of business owners into the biggest supporters of refactoring in your organization.\u003cbr/\u003eSpeaker\u003c/p\u003e\u003cp\u003eNeil Green is currently a Technical Team Lead at Silverpop. He formerly served as Web Team Lead at Incomm and Principal User Interface Engineer for AutoTrader. By day, he works with Java and HTML/CSS/JavaScript to build browser based RIA\u0026#8217;s. By night, he tinkers with Scala and Flex on his own pet projects. Neil was born and raised in the sunny islands of the Bahamas, and often wonders why he isn\u0026#8217;t living on a beach drinking rum instead of being stuck in traffic on 285.\u003c/p\u003e",
    "start":"2010-09-20 19:00:00","end":"2010-09-20 21:00:00","allDay":
    false,"jugName":"Atlanta Java Users Group","jugFriendlyName":"AJUG",
    "jugWebSite":"http://www.ajug.org/"},{"title":
    "Android development with Flash Platform ","description":
    "\u003cp\u003e\u003cstrong\u003eATTENZIONE: luogo, data e orario sono ancora provvisori.\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e9.00\u003c/strong\u003e Accoglienza\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e9.15\u003c/strong\u003e \u003cem\u003e\"Android development with Flash Platform\"\u003c/em\u003e, a cura di Luca Mezzalira\u003c/p\u003e\u003cp\u003eIl seminario tratterà le possibilità di sviluppare applicativi online ed eseguibili per i dispositivi Android 2.2 in su con Flash, Flex ed Adobe AIR 2.\u003cbr/\u003eDurante l\u0026#8217;evento andremo a vedere come utilizzare queste tecnologie per dispositivi mobili, faremo una breve\u003cbr/\u003epanoramica su Actionscript 3 e i suoi paradigmi di programmazione.\u003cbr/\u003eInoltre andremo a vedere il workflow operativo per lo sviluppo di un\u0026#8217;applicazione e faremo un esempio dal vivo su come procedere per il testing e l\u0026#8217;ottimizzazione direttamente sul device.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e10.45\u003c/strong\u003e while( \u003cstrong\u003ecoffee\u003c/strong\u003e ) \u003cstrong\u003ebreak\u003c/strong\u003e;\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e11.00\u003c/strong\u003e \u003cem\u003e\"Android development with Flash Platform\"\u003c/em\u003e (continuazione), a cura di Luca Mezzalira\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e13.00\u003c/strong\u003e Fine meeting\u003c/p\u003e\u003cp\u003eLa partecipazione è, come sempre, \u003cstrong\u003elibera e gratuita\u003c/strong\u003e.\u003c/p\u003e\u003cp\u003eAl termine del meeting andremo tutti assieme a mangiare una pizza.\u003c/p\u003e",
    "start":"2010-09-24 09:00:00","end":"2010-09-24 13:00:00","allDay":
    false,"jugName":"JUG Padova","jugFriendlyName":"jugpadova","jugWebSite":
    "http://www.jugpadova.it"},{"title":"aspectj","description":
    "\u003cp\u003eIntroduction to aspect oriented programming (OAP), which isolates secondary or supporting functions like logging or access control from the main program\u0026#8217;s business logic. Then we see how to use aspects to implement Design by Contract (DbC) which extend the ordinary definition of abstract data types with preconditions, postconditions and invariants. Code examples.\u003c/p\u003e",
    "start":"2010-10-06 18:00:00","end":"2010-10-06 19:30:00","allDay":
    false,"jugName":"JUGBZ","jugWebSite":"http://www.jugbz.org/"},{"title":
    "High-Performance Scalability for Enterprise Applications with Enterprise Ehcache ",
    "description":
    "\u003cp\u003e\u003ca href\u003d\"http://www.intertech.com/UserGroups/JUGPresentation.aspx?TopicID\u003d152\"\u003eAbstract\u003c/a\u003e\u003c/p\u003e",
    "start":"2010-10-10 17:30:00","end":"2010-10-10 19:30:00","allDay":
    false,"jugName":"Twin Cities Java User Group (TCJUG)","jugWebSite":
    "http://www.tcjug.org"},{"title":"Guillaume Bort, Play! Framework",
    "description":
    "\u003cp\u003eGuillaume is cofounder and CTO of Zenexity, a french ‘web oriented architecture’ company. He is the creator and lead developer of the Play! framework, which makes it easier to build Web applications in Java.\u003c/p\u003e",
    "start":"2010-10-14 19:00:00","end":"2010-10-14 22:00:00","allDay":
    false,"jugName":"Brussels JUG","jugFriendlyName":"","jugWebSite":
    "http://www.brujug.be"},{"title":
    "High-Performance Scalability for Enterprise Applications with Enterprise Ehcache",
    "description":
    "\u003cp\u003eDescription\u003c/p\u003e\u003cp\u003eScaling enterprise applications is hard. Traditional architectures that use the database as a hub of application data and shared state lead to performance bottlenecks, excessive database license and hardware costs, and vendor lock-in. Many homegrown or patched-together solutions at worst don\u0026#8217;t work and at best suck hours of developer time that could be better spent elsewhere.\u003c/p\u003e\u003cp\u003eEnterprise Ehcache is an easy-to-deploy solution to these hard-to-solve scale and throughput problems. Ehcache has long been the de facto standard for Java caching and is the default cache for many popular frameworks and containers such as Hibernate, Spring, Tomcat, JBoss, WebLogic, WebSphere, and ColdFusion. In this presentation you will learn how to use Enterprise Ehcache to speed up and scale out your application from one node to 1,000s, to large virtualized environments and clouds:\u003c/p\u003e\u003cul\u003e\u003cli\u003eBackground---standard caching theory and practice\u003c/li\u003e\u003cli\u003eGetting started---the Ehcache API and configuration\u003c/li\u003e\u003cli\u003eWeb caching\u003c/li\u003e\u003cli\u003eAdvanced scaling techniques---configuring and deploying a distributed cache\u003c/li\u003e\u003cli\u003eFlexibility, management, and control---decorators, listeners, statistics, and monitoring\u003c/li\u003e\u003cli\u003eCloud deployment\u003c/li\u003e\u003cli\u003eTuning and monitoring best practices\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eSpeaker\u003c/p\u003e\u003cp\u003eAs Sr. Director of World Wide Field Engineering for Terracotta, Dan Juengst leads a world-class technical team that helps enterprise IT organizations improve their service availability and application performance through the application of the industry leading Terracotta Java Scalability Technology.  Prior to Terracotta, Dan served as VP of Technical Services for CA\u0026#8217;s Wily Application Performance Management business.  During his tenure at CA Wily, Dan helped many Fortune 500 and Global 2000 companies manage the performance of their mission-critical Web Applications.  Previously, Dan worked at Sun Microsystems and Silicon Graphics Computer Systems (SGI) helping customers optimize the performance of their software applications in supercomputing and grid-computing environments.  Dan\u0026#8217;s roots in high performance computing originated in his work in applying Computational Fluid Dynamics techniques to hypersonic air vehicle design at Lockheed-Martin and Boeing.\u003c/p\u003e",
    "start":"2010-10-18 19:00:00","end":"2010-10-18 21:00:00","allDay":
    false,"jugName":"Atlanta Java Users Group","jugFriendlyName":"AJUG",
    "jugWebSite":"http://www.ajug.org/"},{"title":
    "Anton Epple, NetBeans Rich-Client Platform Development Bootcamp",
    "description":
    "\u003cp\u003eThe NetBeans Platform (RCP) is a generic framework for Swing applications. It provides the “plumbing” that, usually, every developer has to write themselves—saving state, connecting actions to menu items, toolbar items and keyboard shortcuts; window management, and so on.\u003c/p\u003e\u003cp\u003eDuring this bootcamp, Anton introduces us into NetBeans Rich-Client Platform Development by a practical step-by-step development of a Rich Client Swing application.\u003c/p\u003e",
    "start":"2010-10-28 19:00:00","end":"2010-10-28 22:00:00","allDay":
    false,"jugName":"Brussels JUG","jugFriendlyName":"","jugWebSite":
    "http://www.brujug.be"},{"title":
    "John Rizzo, JPA/Hibernate Lifecycle - COURSE","description":
    "\u003cp\u003eJPA/Hibernate hides many DB related problems from developers. But it is wrong (and dangerous) to think that using JPA and Hibernate requires few or no knowledge of what happens under the cover. \u003c/p\u003e\u003cp\u003eThis advanced course explains in depth...\u003c/p\u003e",
    "start":"2010-12-16 19:00:00","end":"2010-12-16 22:00:00","allDay":
    false,"jugName":"Brussels JUG","jugFriendlyName":"","jugWebSite":
    "http://www.brujug.be"},{"title":
    "Igor Drobiazko \u0026 Ulrich Stärk,Tapestry 5 Night","description":
    "\u003cp\u003eApache Tapestry is an open-source, component-based web application framework for Java. It features concise templates, minimal amounts of Java code, high performance, and important productivity features such as live class reloading. \u003cbr/\u003eTalk 1: Introduction to Apache Tapestry\u003cbr/\u003eTalk 2: Wicket vs. Tapestry: A Head-to-Head Comparison\u003cbr/\u003eTalk 3: JavaServer Faces 2.0 vs. Tapestry 5: A Head-to-Head Comparison\u003c/p\u003e",
    "start":"2011-02-17 19:00:00","end":"2011-02-17 22:00:00","allDay":
    false,"jugName":"Brussels JUG","jugFriendlyName":"","jugWebSite":
    "http://www.brujug.be"},{"title":"John Rizzo, Vaadin}\u003e",
    "description":
    "\u003cp\u003eVaadin is a web application framework for Rich Internet Applications (RIA). In contrast to Javascript libraries and browser-plugin based solutions, it features a server-side architecture, which means that the largest part of the logic runs on the server. Ajax technology is used on the browser side to ensure a rich and interactive user experience. \u003cbr/\u003e../..\u003c/p\u003e",
    "start":"2011-03-30 19:00:00","end":"2011-03-30 22:00:00","allDay":
    false,"jugName":"Brussels JUG","jugFriendlyName":"","jugWebSite":
    "http://www.brujug.be"},{"title":"Caravana GUJavaSC \u002709",
    "description":"\u003cp\u003eCaravana GUJavaSC \u002709\u003c/p\u003e",
    "start":"2011-12-04 08:30:00","end":"2011-12-04 18:00:00","allDay":
    false,"jugName":"GUJavaSC","jugWebSite":"http://gujavasc.dev.java.net"}]